nxp-appcodehub/dm-mcxw71-driving-lcd-wireless-uart/source/wireless_uart.c
#if !(defined(cPWR_UsePowerDownMode) && (cPWR_UsePowerDownMode))
    LedStartFlashingAllLeds();
#endif
#if (gWuart_AutoStart_c == 1)
    BleApp_Start(mGapRole);
#endif
}

/*! *********************************************************************************
 * \brief        Function handling the geeneric events from the host stack.
 *
 ********************************************************************************** */
static void BluetoothLEHost_GenericCallback(gapGenericEvent_t *pGenericEvent)
{
    /* Call BLE Conn Manager */
    BleConnManager_GenericEvent(pGenericEvent);

#if defined(gUseControllerNotifications_c) && (gUseControllerNotifications_c)
    if (pGenericEvent->eventType == gControllerNotificationEvent_c)
    {
        BleApp_HandleControllerNotification(&pGenericEvent->eventData.notifEvent);
    }
#endif /* gUseControllerNotifications_c */
    if(pGenericEvent->eventType == gInternalError_c)
    {
        if((pGenericEvent->eventData.internalError.errorCode == gBleOverflow_c) && (pGenericEvent->eventData.internalError.errorSource == gAddNewConnection_c))
        {
            Serial_Print("Connection failed ", gAllowToBlock_d);
#if gWuart_PeripheralRole_c == 1
            if(mAdvState.advOn)
            {
                mAdvState.advOn = FALSE;
                Serial_Print(" as peripheral.\n\r", gAllowToBlock_d);
            }
            else
#endif /* gWuart_PeripheralRole_c == 1 */
            {
#if gWuart_CentralRole_c == 1
                Serial_Print(" as central.\n\r", gAllowToBlock_d);
#endif /* gWuart_CentralRole_c == 1 */

            }
        }
    }
}



void LVGL_CallBack()
{

		(void)TM_InstallCallback((timer_handle_t)mLVGLId, LVGL_TimerCallback, NULL);

        (void)TM_Start((timer_handle_t)mLVGLId,
                    (uint8_t)kTimerModeLowPowerTimer | (uint8_t)kTimerModeSingleShot, LVGLIntervalInMs_c);

}

void LVGL_TimerCallback()
	{
	    (void)LVGL_btn();
	    LVGL_CallBack();
	}
void LVGL_init_demo()
{
			BleApp_SendUartStream(&vec_welcome[0], 70U);
}
void LVGL_btn(void)
{



	//display
	                if(set_btn == 1)
	                {
	                	BleApp_SendUartStream(&vec_set_btn[0], 70U);
	                	set_btn = 0;
	                }
	                else if(reset_btn == 1)
					{
	                	BleApp_SendUartStream(&vec_reset_btn[0], 70U);
	                	reset_btn = 0;
					}
	                else if(start_btn == 1)
					{
	                	BleApp_SendUartStream(&vec_start_btn[0], 70U);

	                	//BleApp_SendUartStream(&vec_timer_msg[0], 70U);
	                	start_btn = 0;
	                	//timer = 1;

					}
	                else if(stop_btn == 1)
					{
	                	BleApp_SendUartStream(&vec_stop_btn[0], 70U);
	                	stop_btn = 0;
					}
	                else if(set_date_btn == 1)
	                {
	                							vec_setdate_btn[23]= '[';
	                							vec_setdate_btn[24]= current_date_ble[0];
	                							vec_setdate_btn[25]= current_date_ble[1];
	                							vec_setdate_btn[26]= current_date_ble[2];
	                							vec_setdate_btn[27]= current_date_ble[3];
	                							vec_setdate_btn[28]= '/';
	                							vec_setdate_btn[29]= current_date_ble[5];
	                							vec_setdate_btn[30]= current_date_ble[6];
	                							vec_setdate_btn[31]= '/';
	                							vec_setdate_btn[32]= current_date_ble[8];
	                							vec_setdate_btn[33]= current_date_ble[9];
	                							vec_setdate_btn[34]= ']';

	                		                	BleApp_SendUartStream(&vec_setdate_btn[0], 70U);
	                		                	set_date_btn = 0;
	                }
                     else if(set_timer_btn == 1)
	                {



	                	vec_timer_btn[23]= '[';
	                	vec_timer_btn[24]= current_timer_ble[0];
	                	vec_timer_btn[25]= current_timer_ble[1];
	                	vec_timer_btn[26]= ':';
	                	vec_timer_btn[27]= current_timer_ble[2];
	                	vec_timer_btn[28]= current_timer_ble[3];
	                	vec_timer_btn[29]= ':';
	                	vec_timer_btn[30]= current_timer_ble[4];
	                	vec_timer_btn[31]= current_timer_ble[5];
	                	vec_timer_btn[32]= ']';

	                	BleApp_SendUartStream(&vec_timer_btn[0], 70U);
	                	set_timer_btn = 0;
	                }
	                else if(timer_init == 1)
	                {
	                	BleApp_SendUartStream(&vec_timerInit_btn[0], 90U);
	                	timer_init = 0;
	                }

}




/*! *********************************************************************************
 * @}
 ********************************************************************************** */
